Repository: OldSkoolzRoolz/ai-assisted-it-manager
Catalog: src/ClientApp/Resources/Strings.*.resx
Languages: es

source: Policy editor initialized
es: Editor de politicas inicializado

# PolicyEditor.CatalogLoaded
source: Catalog '{LanguageTag}' loaded with {PolicyCount} policies in {ElapsedMs} ms
es: Catalogo '{LanguageTag}' cargado con {PolicyCount} directivas en {ElapsedMs} ms

# PolicyEditor.CatalogLoadFailed
source: Catalog load failed for language '{LanguageTag}'
es: Error al cargar el catalogo para el idioma '{LanguageTag}'

# PolicyEditor.SearchFilterApplied
source: Search filter applied: '{Query}'
es: Filtro de busqueda aplicado: '{Query}'

# PolicyEditor.SearchExecuted
source: Search executed for '{Query}' returning {ResultCount} items
es: Busqueda ejecutada para '{Query}' con {ResultCount} elementos

# PolicyEditor.CategoryExpanded
source: Category expanded: {CategoryId} (ChildCategories={ChildCategoryCount}, Policies={PolicyCount})
es: Categoria expandida: {CategoryId} (Subcategorias={ChildCategoryCount}, Directivas={PolicyCount})

# PolicyEditor.PolicySelected
source: Policy selected: {PolicyKey} ({SettingCount} settings)
es: Directiva seleccionada: {PolicyKey} ({SettingCount} configuraciones)

# PolicyEditor.UnexpectedCatalogException
source: Unexpected exception loading catalog for language {LanguageTag}
es: Excepcion no esperada cargando catalogo para idioma {LanguageTag}

# PolicyEditor.PolicyNotFound
source: Selected policy key {PolicyKey} not found in catalog documents
es: Clave de directiva seleccionada {PolicyKey} no encontrada

# App.StartupBanner
source: ClientApp starting at {StartTimeUtc}
es: ClientApp iniciando a {StartTimeUtc}
